In [3]:
import pandas as pd

data = pd.read_csv('sample_anova.csv')
data.head()

   emp_id first_name last_name gender  salary work_exp
0       1     Georgi   Facello      M  500000      Mid
1       2    Bezalel    Simmel      F  120000   Junior
2       3      Parto   Bamford      M  350000   Junior
3       4  Chirstian   Koblick      M  400000      Mid
4       5    Kyoichi  Maliniak      M  200000   Junior

In [4]:
df = data[['salary', 'work_exp']]
df.head()

   salary work_exp
0  500000      Mid
1  120000   Junior
2  350000   Junior
3  400000      Mid
4  200000   Junior

In [6]:
from scipy import stats

f, p = stats.f_oneway(df[df.work_exp == 'Junior']. salary,
                      df[df.work_exp == 'Mid']. salary,
                      df[df.work_exp == 'Senior']. salary)
f, p

(np.float64(43.767065333017584), np.float64(2.84255584357536e-14))

In [7]:
import numpy as np

bins = np.linspace(min(df['salary']), max(df['salary']), 4)
bins

array([120000., 330000., 540000., 750000.])

In [8]:
bin_name = ['Low', 'Medium', 'High']
data['new_salary_group'] = pd.cut(data['salary'], bins, labels=bin_name, include_lowest=True)
data.head(10)

   emp_id first_name  last_name gender  salary work_exp new_salary_group
0       1     Georgi    Facello      M  500000      Mid           Medium
1       2    Bezalel     Simmel      F  120000   Junior              Low
2       3      Parto    Bamford      M  350000   Junior           Medium
3       4  Chirstian    Koblick      M  400000      Mid           Medium
4       5    Kyoichi   Maliniak      M  200000   Junior              Low
5       6     Anneke    Preusig      F  300000   Junior              Low
6       7    Tzvetan  Zielinski      F  150000   Junior              Low
7       8     Saniya   Kalloufi      M  750000      Mid             High
8       9     Sumant       Peac      F  750000   Senior             High
9      10  Duangkaew   Piveteau      F  200000   Junior              Low

In [9]:
f, p = stats.f_oneway(data[data.new_salary_group == 'Low']. salary,
                      data[data.new_salary_group == 'Medium']. salary,
                      data[data.new_salary_group == 'High']. salary)
f, p

(np.float64(579.7277387424342), np.float64(1.1214878408179476e-54))